-- MySQL dump 10.13  Distrib 8.0.27, for Win64 (x86_64)
--
-- Host: localhost    Database: java67
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `department`
--

DROP TABLE IF EXISTS `department`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `department` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `type` varchar(25) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `department`
--

LOCK TABLES `department` WRITE;
/*!40000 ALTER TABLE `department` DISABLE KEYS */;
/*!40000 ALTER TABLE `department` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `employee`
--

DROP TABLE IF EXISTS `employee`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `employee` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(25) DEFAULT NULL,
  `email` varchar(50) DEFAULT NULL,
  `teptid` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `employee`
--

LOCK TABLES `employee` WRITE;
/*!40000 ALTER TABLE `employee` DISABLE KEYS */;
/*!40000 ALTER TABLE `employee` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `newteacher`
--

DROP TABLE IF EXISTS `newteacher`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `newteacher` (
  `jobnum` int NOT NULL DEFAULT '0',
  `name` varchar(20) NOT NULL,
  `sex` char(2) NOT NULL,
  `subject` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `newteacher`
--

LOCK TABLES `newteacher` WRITE;
/*!40000 ALTER TABLE `newteacher` DISABLE KEYS */;
INSERT INTO `newteacher` VALUES (1,'默凡语','男','大学语文'),(2,'李宗盛','男','大学音乐'),(3,'路飞','男','大学体育'),(4,'索隆','男','大学物理'),(0,'阿庆嫂','女','哲学');
/*!40000 ALTER TABLE `newteacher` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `stu_tea_relation`
--

DROP TABLE IF EXISTS `stu_tea_relation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `stu_tea_relation` (
  `id` int DEFAULT NULL,
  `name` varchar(20) DEFAULT NULL,
  `stu_id` int DEFAULT NULL,
  `tea_id` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `stu_tea_relation`
--

LOCK TABLES `stu_tea_relation` WRITE;
/*!40000 ALTER TABLE `stu_tea_relation` DISABLE KEYS */;
/*!40000 ALTER TABLE `stu_tea_relation` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student`
--

DROP TABLE IF EXISTS `student`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `sex` char(4) NOT NULL,
  `age` smallint NOT NULL,
  PRIMARY KEY (`id`),
  CONSTRAINT `age_check` CHECK ((`age` between 1 and 120)),
  CONSTRAINT `sex_check` CHECK (((`sex` = _utf8mb4'男') or (`sex` = _utf8mb4'女')))
) ENGINE=InnoDB AUTO_INCREMENT=10021 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student`
--

LOCK TABLES `student` WRITE;
/*!40000 ALTER TABLE `student` DISABLE KEYS */;
INSERT INTO `student` VALUES (5,'美杜莎','女',20),(6,'美杜莎','女',20),(7,'美杜莎','女',20),(8,'美杜莎','女',20),(9,'美杜莎','女',20),(10,'美杜莎','女',20),(11,'美杜莎','女',20),(12,'美杜莎','女',20),(13,'美杜莎','女',20),(14,'美杜莎','女',20),(15,'美杜莎','女',20),(16,'美杜莎','女',20),(17,'美杜莎','女',20),(18,'美杜莎','女',20),(19,'美杜莎','女',20),(20,'美杜莎','女',20),(21,'美杜莎','女',20),(22,'美杜莎','女',20),(23,'美杜莎','女',20),(24,'美杜莎','女',20),(25,'美杜莎','女',20),(26,'美杜莎','女',20),(27,'美杜莎','女',20),(28,'美杜莎','女',20),(29,'美杜莎','女',20),(30,'美杜莎','女',20),(31,'美杜莎','女',20),(32,'美杜莎','女',20),(33,'美杜莎','女',20),(34,'美杜莎','女',20),(35,'美杜莎','女',20),(36,'美杜莎','女',20),(37,'美杜莎','女',20),(38,'美杜莎','女',20),(39,'美杜莎','女',20),(40,'美杜莎','女',20),(41,'美杜莎','女',20),(42,'美杜莎','女',20),(43,'美杜莎','女',20),(44,'美杜莎','女',20),(45,'美杜莎','女',20),(46,'美杜莎','女',20),(47,'美杜莎','女',20),(48,'美杜莎','女',20),(49,'美杜莎','女',20),(50,'美杜莎','女',20),(51,'美杜莎','女',20),(52,'美杜莎','女',20),(53,'美杜莎','女',20),(54,'美杜莎','女',20),(55,'美杜莎','女',20),(56,'美杜莎','女',20),(57,'美杜莎','女',20),(58,'美杜莎','女',20),(59,'美杜莎','女',20),(60,'美杜莎','女',20),(61,'美杜莎','女',20),(62,'美杜莎','女',20),(63,'美杜莎','女',20),(64,'美杜莎','女',20),(65,'美杜莎','女',20),(66,'美杜莎','女',20),(67,'美杜莎','女',20),(68,'美杜莎','女',20),(69,'美杜莎','女',20),(70,'美杜莎','女',20),(71,'美杜莎','女',20),(72,'美杜莎','女',20),(73,'美杜莎','女',20),(74,'美杜莎','女',20),(75,'美杜莎','女',20),(76,'美杜莎','女',20),(77,'美杜莎','女',20),(78,'美杜莎','女',20),(79,'美杜莎','女',20),(80,'美杜莎','女',20),(81,'美杜莎','女',20),(82,'美杜莎','女',20),(83,'美杜莎','女',20),(84,'美杜莎','女',20),(85,'美杜莎','女',20),(86,'美杜莎','女',20),(87,'美杜莎','女',20),(88,'美杜莎','女',20),(89,'美杜莎','女',20),(90,'美杜莎','女',20),(91,'美杜莎','女',20),(92,'美杜莎','女',20),(93,'美杜莎','女',20),(94,'美杜莎','女',20),(95,'美杜莎','女',20),(96,'美杜莎','女',20),(97,'美杜莎','女',20),(98,'美杜莎','女',20),(99,'波塞冬','男',22),(100,'窦娥','女',21),(101,'美杜莎','女',20),(102,'美杜莎','女',20),(103,'美杜莎','女',20),(104,'美杜莎','女',20),(105,'美杜莎','女',20),(106,'美杜莎','女',20),(107,'美杜莎','女',20),(108,'美杜莎','女',20),(109,'美杜莎','女',20),(110,'美杜莎','女',20),(111,'美杜莎','女',20),(112,'美杜莎','女',20),(113,'美杜莎','女',20),(114,'美杜莎','女',20),(115,'美杜莎','女',20),(116,'美杜莎','女',20),(117,'美杜莎','女',20),(118,'美杜莎','女',20),(119,'美杜莎','女',20),(120,'美杜莎','女',20),(121,'美杜莎','女',20),(122,'美杜莎','女',20),(123,'美杜莎','女',20),(124,'美杜莎','女',20),(125,'美杜莎','女',20),(126,'美杜莎','女',20),(127,'美杜莎','女',20),(128,'美杜莎','女',20),(129,'美杜莎','女',20),(130,'美杜莎','女',20),(131,'美杜莎','女',20),(132,'美杜莎','女',20),(133,'美杜莎','女',20),(134,'美杜莎','女',20),(135,'美杜莎','女',20),(136,'美杜莎','女',20),(137,'美杜莎','女',20),(138,'美杜莎','女',20),(139,'美杜莎','女',20),(140,'美杜莎','女',20),(141,'美杜莎','女',20),(142,'美杜莎','女',20),(143,'美杜莎','女',20),(144,'美杜莎','女',20),(145,'美杜莎','女',20),(146,'美杜莎','女',20),(147,'美杜莎','女',20),(148,'美杜莎','女',20),(149,'美杜莎','女',20),(150,'美杜莎','女',20),(151,'美杜莎','女',20),(152,'美杜莎','女',20),(153,'美杜莎','女',20),(154,'美杜莎','女',20),(155,'美杜莎','女',20),(156,'美杜莎','女',20),(157,'美杜莎','女',20),(158,'美杜莎','女',20),(159,'美杜莎','女',20),(160,'美杜莎','女',20),(161,'美杜莎','女',20),(162,'美杜莎','女',20),(163,'美杜莎','女',20),(164,'美杜莎','女',20),(165,'美杜莎','女',20),(166,'美杜莎','女',20),(167,'美杜莎','女',20),(168,'美杜莎','女',20),(169,'美杜莎','女',20),(170,'美杜莎','女',20),(171,'美杜莎','女',20),(172,'美杜莎','女',20),(173,'美杜莎','女',20),(174,'美杜莎','女',20),(175,'美杜莎','女',20),(176,'美杜莎','女',20),(177,'美杜莎','女',20),(178,'美杜莎','女',20),(179,'美杜莎','女',20),(180,'美杜莎','女',20),(181,'美杜莎','女',20),(182,'美杜莎','女',20),(183,'美杜莎','女',20),(184,'美杜莎','女',20),(185,'美杜莎','女',20),(186,'美杜莎','女',20),(187,'美杜莎','女',20),(188,'美杜莎','女',20),(189,'美杜莎','女',20),(190,'美杜莎','女',20),(191,'美杜莎','女',20),(192,'美杜莎','女',20),(193,'美杜莎','女',20),(194,'美杜莎','女',20),(195,'美杜莎','女',20),(196,'美杜莎','女',20),(197,'美杜莎','女',20),(198,'美杜莎','女',20),(199,'美杜莎','女',20),(200,'赫拉','女',21),(201,'美杜莎','女',20),(202,'美杜莎','女',20),(203,'美杜莎','女',20),(204,'美杜莎','女',20),(205,'美杜莎','女',20),(206,'美杜莎','女',20),(207,'美杜莎','女',20),(208,'美杜莎','女',20),(209,'美杜莎','女',20),(210,'美杜莎','女',20),(211,'美杜莎','女',20),(212,'美杜莎','女',20),(213,'美杜莎','女',20),(214,'美杜莎','女',20),(215,'美杜莎','女',20),(216,'美杜莎','女',20),(217,'美杜莎','女',20),(218,'美杜莎','女',20),(219,'美杜莎','女',20),(220,'美杜莎','女',20),(221,'美杜莎','女',20),(222,'美杜莎','女',20),(223,'美杜莎','女',20),(224,'美杜莎','女',20),(225,'美杜莎','女',20),(226,'美杜莎','女',20),(227,'美杜莎','女',20),(228,'美杜莎','女',20),(229,'美杜莎','女',20),(230,'美杜莎','女',20),(231,'美杜莎','女',20),(232,'美杜莎','女',20),(233,'美杜莎','女',20),(234,'美杜莎','女',20),(235,'美杜莎','女',20),(236,'美杜莎','女',20),(237,'美杜莎','女',20),(238,'美杜莎','女',20),(239,'美杜莎','女',20),(240,'美杜莎','女',20),(241,'美杜莎','女',20),(242,'美杜莎','女',20),(243,'美杜莎','女',20),(244,'美杜莎','女',20),(245,'美杜莎','女',20),(246,'美杜莎','女',20),(247,'美杜莎','女',20),(248,'美杜莎','女',20),(249,'美杜莎','女',20),(250,'美杜莎','女',20),(251,'美杜莎','女',20),(252,'美杜莎','女',20),(253,'美杜莎','女',20),(254,'美杜莎','女',20),(255,'美杜莎','女',20),(256,'美杜莎','女',20),(257,'美杜莎','女',20),(258,'美杜莎','女',20),(259,'美杜莎','女',20),(260,'美杜莎','女',20),(261,'美杜莎','女',20),(262,'美杜莎','女',20),(263,'美杜莎','女',20),(264,'美杜莎','女',20),(265,'美杜莎','女',20),(266,'美杜莎','女',20),(267,'美杜莎','女',20),(268,'美杜莎','女',20),(269,'美杜莎','女',20),(270,'美杜莎','女',20),(271,'美杜莎','女',20),(272,'美杜莎','女',20),(273,'美杜莎','女',20),(274,'美杜莎','女',20),(275,'美杜莎','女',20),(276,'美杜莎','女',20),(277,'美杜莎','女',20),(278,'美杜莎','女',20),(279,'美杜莎','女',20),(280,'美杜莎','女',20),(281,'美杜莎','女',20),(282,'美杜莎','女',20),(283,'美杜莎','女',20),(284,'美杜莎','女',20),(285,'美杜莎','女',20),(286,'美杜莎','女',20),(287,'美杜莎','女',20),(288,'美杜莎','女',20),(289,'美杜莎','女',20),(290,'美杜莎','女',20),(291,'美杜莎','女',20),(292,'美杜莎','女',20),(293,'美杜莎','女',20),(294,'美杜莎','女',20),(295,'美杜莎','女',20),(296,'美杜莎','女',20),(297,'美杜莎','女',20),(298,'美杜莎','女',20),(299,'美杜莎','女',20),(300,'美杜莎','女',20),(301,'美杜莎','女',20),(302,'美杜莎','女',20),(303,'美杜莎','女',20),(304,'美杜莎','女',20),(305,'美杜莎','女',20),(306,'美杜莎','女',20),(307,'美杜莎','女',20),(308,'美杜莎','女',20),(309,'美杜莎','女',20),(310,'美杜莎','女',20),(311,'美杜莎','女',20),(312,'美杜莎','女',20),(313,'美杜莎','女',20),(314,'美杜莎','女',20),(315,'美杜莎','女',20),(316,'美杜莎','女',20),(317,'美杜莎','女',20),(318,'美杜莎','女',20),(319,'美杜莎','女',20),(320,'美杜莎','女',20),(321,'美杜莎','女',20),(322,'美杜莎','女',20),(323,'美杜莎','女',20),(324,'美杜莎','女',20),(325,'美杜莎','女',20),(326,'美杜莎','女',20),(327,'美杜莎','女',20),(328,'美杜莎','女',20),(329,'美杜莎','女',20),(330,'美杜莎','女',20),(331,'美杜莎','女',20),(332,'美杜莎','女',20),(333,'美杜莎','女',20),(334,'美杜莎','女',20),(335,'美杜莎','女',20),(336,'美杜莎','女',20),(337,'美杜莎','女',20),(338,'美杜莎','女',20),(339,'美杜莎','女',20),(340,'美杜莎','女',20),(341,'美杜莎','女',20),(342,'美杜莎','女',20),(343,'美杜莎','女',20),(344,'美杜莎','女',20),(345,'美杜莎','女',20),(346,'美杜莎','女',20),(347,'美杜莎','女',20),(348,'美杜莎','女',20),(349,'美杜莎','女',20),(350,'美杜莎','女',20),(351,'美杜莎','女',20),(352,'美杜莎','女',20),(353,'美杜莎','女',20),(354,'美杜莎','女',20),(355,'美杜莎','女',20),(356,'美杜莎','女',20),(357,'美杜莎','女',20),(358,'美杜莎','女',20),(359,'美杜莎','女',20),(360,'美杜莎','女',20),(361,'美杜莎','女',20),(362,'美杜莎','女',20),(363,'美杜莎','女',20),(364,'美杜莎','女',20),(365,'美杜莎','女',20),(366,'美杜莎','女',20),(367,'美杜莎','女',20),(368,'美杜莎','女',20),(369,'美杜莎','女',20),(370,'美杜莎','女',20),(371,'美杜莎','女',20),(372,'美杜莎','女',20),(373,'美杜莎','女',20),(374,'美杜莎','女',20),(375,'美杜莎','女',20),(376,'美杜莎','女',20),(377,'美杜莎','女',20),(378,'美杜莎','女',20),(379,'美杜莎','女',20),(380,'美杜莎','女',20),(381,'美杜莎','女',20),(382,'美杜莎','女',20),(383,'美杜莎','女',20),(384,'美杜莎','女',20),(385,'美杜莎','女',20),(386,'美杜莎','女',20),(387,'美杜莎','女',20),(388,'美杜莎','女',20),(389,'美杜莎','女',20),(390,'美杜莎','女',20),(391,'美杜莎','女',20),(392,'美杜莎','女',20),(393,'美杜莎','女',20),(394,'美杜莎','女',20),(395,'美杜莎','女',20),(396,'美杜莎','女',20),(397,'美杜莎','女',20),(398,'美杜莎','女',20),(399,'美杜莎','女',20),(400,'美杜莎','女',20),(401,'美杜莎','女',20),(402,'美杜莎','女',20),(403,'美杜莎','女',20),(404,'美杜莎','女',20),(405,'美杜莎','女',20),(406,'美杜莎','女',20),(407,'美杜莎','女',20),(408,'美杜莎','女',20),(409,'美杜莎','女',20),(410,'美杜莎','女',20),(411,'美杜莎','女',20),(412,'美杜莎','女',20),(413,'美杜莎','女',20),(414,'美杜莎','女',20),(415,'美杜莎','女',20),(416,'美杜莎','女',20),(417,'美杜莎','女',20),(418,'美杜莎','女',20),(419,'美杜莎','女',20),(420,'美杜莎','女',20),(421,'美杜莎','女',20),(422,'美杜莎','女',20),(423,'美杜莎','女',20),(424,'美杜莎','女',20),(425,'美杜莎','女',20),(426,'美杜莎','女',20),(427,'美杜莎','女',20),(428,'美杜莎','女',20),(429,'美杜莎','女',20),(430,'美杜莎','女',20),(431,'美杜莎','女',20),(432,'美杜莎','女',20),(433,'美杜莎','女',20),(434,'美杜莎','女',20),(435,'美杜莎','女',20),(436,'美杜莎','女',20),(437,'美杜莎','女',20),(438,'美杜莎','女',20),(439,'美杜莎','女',20),(440,'美杜莎','女',20),(441,'美杜莎','女',20),(442,'美杜莎','女',20),(443,'美杜莎','女',20),(444,'美杜莎','女',20),(445,'美杜莎','女',20),(446,'美杜莎','女',20),(447,'美杜莎','女',20),(448,'美杜莎','女',20),(449,'美杜莎','女',20),(450,'美杜莎','女',20),(451,'美杜莎','女',20),(452,'美杜莎','女',20),(453,'美杜莎','女',20),(454,'美杜莎','女',20),(455,'美杜莎','女',20),(456,'美杜莎','女',20),(457,'美杜莎','女',20),(458,'美杜莎','女',20),(459,'美杜莎','女',20),(460,'美杜莎','女',20),(461,'美杜莎','女',20),(462,'美杜莎','女',20),(463,'美杜莎','女',20),(464,'美杜莎','女',20),(465,'美杜莎','女',20),(466,'美杜莎','女',20),(467,'美杜莎','女',20),(468,'美杜莎','女',20),(469,'美杜莎','女',20),(470,'美杜莎','女',20),(471,'美杜莎','女',20),(472,'美杜莎','女',20),(473,'美杜莎','女',20),(474,'美杜莎','女',20),(475,'美杜莎','女',20),(476,'美杜莎','女',20),(477,'美杜莎','女',20),(478,'美杜莎','女',20),(479,'美杜莎','女',20),(480,'美杜莎','女',20),(481,'美杜莎','女',20),(482,'美杜莎','女',20),(483,'美杜莎','女',20),(484,'美杜莎','女',20),(485,'美杜莎','女',20),(486,'美杜莎','女',20),(487,'美杜莎','女',20),(488,'美杜莎','女',20),(489,'美杜莎','女',20),(490,'美杜莎','女',20),(491,'美杜莎','女',20),(492,'美杜莎','女',20),(493,'美杜莎','女',20),(494,'美杜莎','女',20),(495,'美杜莎','女',20),(496,'美杜莎','女',20),(497,'美杜莎','女',20),(498,'美杜莎','女',20),(499,'美杜莎','女',20),(500,'美杜莎','女',20),(501,'美杜莎','女',20),(502,'美杜莎','女',20),(503,'美杜莎','女',20),(504,'美杜莎','女',20),(505,'美杜莎','女',20),(506,'美杜莎','女',20),(507,'美杜莎','女',20),(508,'美杜莎','女',20),(509,'美杜莎','女',20),(510,'美杜莎','女',20),(511,'美杜莎','女',20),(512,'美杜莎','女',20),(513,'美杜莎','女',20),(514,'美杜莎','女',20),(515,'美杜莎','女',20),(516,'美杜莎','女',20),(517,'美杜莎','女',20),(518,'美杜莎','女',20),(519,'美杜莎','女',20),(520,'美杜莎','女',20),(521,'美杜莎','女',20),(522,'美杜莎','女',20),(523,'美杜莎','女',20),(524,'美杜莎','女',20),(525,'美杜莎','女',20),(526,'美杜莎','女',20),(527,'美杜莎','女',20),(528,'美杜莎','女',20),(529,'美杜莎','女',20),(530,'美杜莎','女',20),(531,'美杜莎','女',20),(532,'美杜莎','女',20),(533,'美杜莎','女',20),(534,'美杜莎','女',20),(535,'美杜莎','女',20),(536,'美杜莎','女',20),(537,'美杜莎','女',20),(538,'美杜莎','女',20),(539,'美杜莎','女',20),(540,'美杜莎','女',20),(541,'美杜莎','女',20),(542,'美杜莎','女',20),(543,'美杜莎','女',20),(544,'美杜莎','女',20),(545,'美杜莎','女',20),(546,'美杜莎','女',20),(547,'美杜莎','女',20),(548,'美杜莎','女',20),(549,'美杜莎','女',20),(550,'美杜莎','女',20),(551,'美杜莎','女',20),(552,'美杜莎','女',20),(553,'美杜莎','女',20),(554,'美杜莎','女',20),(555,'美杜莎','女',20),(556,'美杜莎','女',20),(557,'美杜莎','女',20),(558,'美杜莎','女',20),(559,'美杜莎','女',20),(560,'美杜莎','女',20),(561,'美杜莎','女',20),(562,'美杜莎','女',20),(563,'美杜莎','女',20),(564,'美杜莎','女',20),(565,'美杜莎','女',20),(566,'美杜莎','女',20),(567,'美杜莎','女',20),(568,'美杜莎','女',20),(569,'美杜莎','女',20),(570,'美杜莎','女',20),(571,'美杜莎','女',20),(572,'美杜莎','女',20),(573,'美杜莎','女',20),(574,'美杜莎','女',20),(575,'美杜莎','女',20),(576,'美杜莎','女',20),(577,'美杜莎','女',20),(578,'美杜莎','女',20),(579,'美杜莎','女',20),(580,'美杜莎','女',20),(581,'美杜莎','女',20),(582,'美杜莎','女',20),(583,'美杜莎','女',20),(584,'美杜莎','女',20),(585,'美杜莎','女',20),(586,'美杜莎','女',20),(587,'美杜莎','女',20),(588,'美杜莎','女',20),(589,'美杜莎','女',20),(590,'美杜莎','女',20),(591,'美杜莎','女',20),(592,'美杜莎','女',20),(593,'美杜莎','女',20),(594,'美杜莎','女',20),(595,'美杜莎','女',20),(596,'美杜莎','女',20),(597,'美杜莎','女',20),(598,'美杜莎','女',20),(599,'美杜莎','女',20),(600,'美杜莎','女',20),(601,'美杜莎','女',20),(602,'美杜莎','女',20),(603,'美杜莎','女',20),(604,'美杜莎','女',20),(605,'美杜莎','女',20),(606,'美杜莎','女',20),(607,'美杜莎','女',20),(608,'美杜莎','女',20),(609,'美杜莎','女',20),(610,'美杜莎','女',20),(611,'美杜莎','女',20),(612,'美杜莎','女',20),(613,'美杜莎','女',20),(614,'美杜莎','女',20),(615,'美杜莎','女',20),(616,'美杜莎','女',20),(617,'美杜莎','女',20),(618,'美杜莎','女',20),(619,'美杜莎','女',20),(620,'美杜莎','女',20),(621,'美杜莎','女',20),(622,'美杜莎','女',20),(623,'美杜莎','女',20),(624,'美杜莎','女',20),(625,'美杜莎','女',20),(626,'美杜莎','女',20),(627,'美杜莎','女',20),(628,'美杜莎','女',20),(629,'美杜莎','女',20),(630,'美杜莎','女',20),(631,'美杜莎','女',20),(632,'美杜莎','女',20),(633,'美杜莎','女',20),(634,'美杜莎','女',20),(635,'美杜莎','女',20),(636,'美杜莎','女',20),(637,'美杜莎','女',20),(638,'美杜莎','女',20),(639,'美杜莎','女',20),(640,'美杜莎','女',20),(641,'美杜莎','女',20),(642,'美杜莎','女',20),(643,'美杜莎','女',20),(644,'美杜莎','女',20),(645,'美杜莎','女',20),(646,'美杜莎','女',20),(647,'美杜莎','女',20),(648,'美杜莎','女',20),(649,'美杜莎','女',20),(650,'美杜莎','女',20),(651,'美杜莎','女',20),(652,'美杜莎','女',20),(653,'美杜莎','女',20),(654,'美杜莎','女',20),(655,'美杜莎','女',20),(656,'美杜莎','女',20),(657,'美杜莎','女',20),(658,'美杜莎','女',20),(659,'美杜莎','女',20),(660,'美杜莎','女',20),(661,'美杜莎','女',20),(662,'美杜莎','女',20),(663,'美杜莎','女',20),(664,'美杜莎','女',20),(665,'美杜莎','女',20),(666,'美杜莎','女',20),(667,'美杜莎','女',20),(668,'美杜莎','女',20),(669,'美杜莎','女',20),(670,'美杜莎','女',20),(671,'美杜莎','女',20),(672,'美杜莎','女',20),(673,'美杜莎','女',20),(674,'美杜莎','女',20),(675,'美杜莎','女',20),(676,'美杜莎','女',20),(677,'美杜莎','女',20),(678,'美杜莎','女',20),(679,'美杜莎','女',20),(680,'美杜莎','女',20),(681,'美杜莎','女',20),(682,'美杜莎','女',20),(683,'美杜莎','女',20),(684,'美杜莎','女',20),(685,'美杜莎','女',20),(686,'美杜莎','女',20),(687,'美杜莎','女',20),(688,'美杜莎','女',20),(689,'美杜莎','女',20),(690,'美杜莎','女',20),(691,'美杜莎','女',20),(692,'美杜莎','女',20),(693,'美杜莎','女',20),(694,'美杜莎','女',20),(695,'美杜莎','女',20),(696,'美杜莎','女',20),(697,'美杜莎','女',20),(698,'美杜莎','女',20),(699,'美杜莎','女',20),(700,'美杜莎','女',20),(701,'美杜莎','女',20),(702,'美杜莎','女',20),(703,'美杜莎','女',20),(704,'美杜莎','女',20),(705,'美杜莎','女',20),(706,'美杜莎','女',20),(707,'美杜莎','女',20),(708,'美杜莎','女',20),(709,'美杜莎','女',20),(710,'美杜莎','女',20),(711,'美杜莎','女',20),(712,'美杜莎','女',20),(713,'美杜莎','女',20),(714,'美杜莎','女',20),(715,'美杜莎','女',20),(716,'美杜莎','女',20),(717,'美杜莎','女',20),(718,'美杜莎','女',20),(719,'美杜莎','女',20),(720,'美杜莎','女',20),(721,'美杜莎','女',20),(722,'美杜莎','女',20),(723,'美杜莎','女',20),(724,'美杜莎','女',20),(725,'美杜莎','女',20),(726,'美杜莎','女',20),(727,'美杜莎','女',20),(728,'美杜莎','女',20),(729,'美杜莎','女',20),(730,'美杜莎','女',20),(731,'美杜莎','女',20),(732,'美杜莎','女',20),(733,'美杜莎','女',20),(734,'美杜莎','女',20),(735,'美杜莎','女',20),(736,'美杜莎','女',20),(737,'美杜莎','女',20),(738,'美杜莎','女',20),(739,'美杜莎','女',20),(740,'美杜莎','女',20),(741,'美杜莎','女',20),(742,'美杜莎','女',20),(743,'美杜莎','女',20),(744,'美杜莎','女',20),(745,'美杜莎','女',20),(746,'美杜莎','女',20),(747,'美杜莎','女',20),(748,'美杜莎','女',20),(749,'美杜莎','女',20),(750,'美杜莎','女',20),(751,'美杜莎','女',20),(752,'美杜莎','女',20),(753,'美杜莎','女',20),(754,'美杜莎','女',20),(755,'美杜莎','女',20),(756,'美杜莎','女',20),(757,'美杜莎','女',20),(758,'美杜莎','女',20),(759,'美杜莎','女',20),(760,'美杜莎','女',20),(761,'美杜莎','女',20),(762,'美杜莎','女',20),(763,'美杜莎','女',20),(764,'美杜莎','女',20),(765,'美杜莎','女',20),(766,'美杜莎','女',20),(767,'美杜莎','女',20),(768,'美杜莎','女',20),(769,'美杜莎','女',20),(770,'美杜莎','女',20),(771,'美杜莎','女',20),(772,'美杜莎','女',20),(773,'美杜莎','女',20),(774,'美杜莎','女',20),(775,'美杜莎','女',20),(776,'美杜莎','女',20),(777,'美杜莎','女',20),(778,'美杜莎','女',20),(779,'美杜莎','女',20),(780,'美杜莎','女',20),(781,'美杜莎','女',20),(782,'美杜莎','女',20),(783,'美杜莎','女',20),(784,'美杜莎','女',20),(785,'美杜莎','女',20),(786,'美杜莎','女',20),(787,'美杜莎','女',20),(788,'美杜莎','女',20),(789,'美杜莎','女',20),(790,'美杜莎','女',20),(791,'美杜莎','女',20),(792,'美杜莎','女',20),(793,'美杜莎','女',20),(794,'美杜莎','女',20),(795,'美杜莎','女',20),(796,'美杜莎','女',20),(797,'美杜莎','女',20),(798,'美杜莎','女',20),(799,'美杜莎','女',20),(800,'美杜莎','女',20),(801,'美杜莎','女',20),(802,'美杜莎','女',20),(803,'美杜莎','女',20),(804,'美杜莎','女',20),(805,'美杜莎','女',20),(806,'美杜莎','女',20),(807,'美杜莎','女',20),(808,'美杜莎','女',20),(809,'美杜莎','女',20),(810,'美杜莎','女',20),(811,'美杜莎','女',20),(812,'美杜莎','女',20),(813,'美杜莎','女',20),(814,'美杜莎','女',20),(815,'美杜莎','女',20),(816,'美杜莎','女',20),(817,'美杜莎','女',20),(818,'美杜莎','女',20),(819,'美杜莎','女',20),(820,'美杜莎','女',20),(821,'美杜莎','女',20),(822,'美杜莎','女',20),(823,'美杜莎','女',20),(824,'美杜莎','女',20),(825,'美杜莎','女',20),(826,'美杜莎','女',20),(827,'美杜莎','女',20),(828,'美杜莎','女',20),(829,'美杜莎','女',20),(830,'美杜莎','女',20),(831,'美杜莎','女',20),(832,'美杜莎','女',20),(833,'美杜莎','女',20),(834,'美杜莎','女',20),(835,'美杜莎','女',20),(836,'美杜莎','女',20),(837,'美杜莎','女',20),(838,'美杜莎','女',20),(839,'美杜莎','女',20),(840,'美杜莎','女',20),(841,'美杜莎','女',20),(842,'美杜莎','女',20),(843,'美杜莎','女',20),(844,'美杜莎','女',20),(845,'美杜莎','女',20),(846,'美杜莎','女',20),(847,'美杜莎','女',20),(848,'美杜莎','女',20),(849,'美杜莎','女',20),(850,'美杜莎','女',20),(851,'美杜莎','女',20),(852,'美杜莎','女',20),(853,'美杜莎','女',20),(854,'美杜莎','女',20),(855,'美杜莎','女',20),(856,'美杜莎','女',20),(857,'美杜莎','女',20),(858,'美杜莎','女',20),(859,'美杜莎','女',20),(860,'美杜莎','女',20),(861,'美杜莎','女',20),(862,'美杜莎','女',20),(863,'美杜莎','女',20),(864,'美杜莎','女',20),(865,'美杜莎','女',20),(866,'美杜莎','女',20),(867,'美杜莎','女',20),(868,'美杜莎','女',20),(869,'美杜莎','女',20),(870,'美杜莎','女',20),(871,'美杜莎','女',20),(872,'美杜莎','女',20),(873,'美杜莎','女',20),(874,'美杜莎','女',20),(875,'美杜莎','女',20),(876,'美杜莎','女',20),(877,'美杜莎','女',20),(878,'美杜莎','女',20),(879,'美杜莎','女',20),(880,'美杜莎','女',20),(881,'美杜莎','女',20),(882,'美杜莎','女',20),(883,'美杜莎','女',20),(884,'美杜莎','女',20),(885,'美杜莎','女',20),(886,'美杜莎','女',20),(887,'美杜莎','女',20),(888,'美杜莎','女',20),(889,'美杜莎','女',20),(890,'美杜莎','女',20),(891,'美杜莎','女',20),(892,'美杜莎','女',20),(893,'美杜莎','女',20),(894,'美杜莎','女',20),(895,'美杜莎','女',20),(896,'美杜莎','女',20),(897,'美杜莎','女',20),(898,'美杜莎','女',20),(899,'美杜莎','女',20),(900,'美杜莎','女',20),(901,'美杜莎','女',20),(902,'美杜莎','女',20),(903,'美杜莎','女',20),(904,'美杜莎','女',20),(905,'美杜莎','女',20),(906,'美杜莎','女',20),(907,'美杜莎','女',20),(908,'美杜莎','女',20),(909,'美杜莎','女',20),(910,'美杜莎','女',20),(911,'美杜莎','女',20),(912,'美杜莎','女',20),(913,'美杜莎','女',20),(914,'美杜莎','女',20),(915,'美杜莎','女',20),(916,'美杜莎','女',20),(917,'美杜莎','女',20),(918,'美杜莎','女',20),(919,'美杜莎','女',20),(920,'美杜莎','女',20),(921,'美杜莎','女',20),(922,'美杜莎','女',20),(923,'美杜莎','女',20),(924,'美杜莎','女',20),(925,'美杜莎','女',20),(926,'美杜莎','女',20),(927,'美杜莎','女',20),(928,'美杜莎','女',20),(929,'美杜莎','女',20),(930,'美杜莎','女',20),(931,'美杜莎','女',20),(932,'美杜莎','女',20),(933,'美杜莎','女',20),(934,'美杜莎','女',20),(935,'美杜莎','女',20),(936,'美杜莎','女',20),(937,'美杜莎','女',20),(938,'美杜莎','女',20),(939,'美杜莎','女',20),(940,'美杜莎','女',20),(941,'美杜莎','女',20),(942,'美杜莎','女',20),(943,'美杜莎','女',20),(944,'美杜莎','女',20),(945,'美杜莎','女',20),(946,'美杜莎','女',20),(947,'美杜莎','女',20),(948,'美杜莎','女',20),(949,'美杜莎','女',20),(950,'美杜莎','女',20),(951,'美杜莎','女',20),(952,'美杜莎','女',20),(953,'美杜莎','女',20),(954,'美杜莎','女',20),(955,'美杜莎','女',20),(956,'美杜莎','女',20),(957,'美杜莎','女',20),(958,'美杜莎','女',20),(959,'美杜莎','女',20),(960,'美杜莎','女',20),(961,'美杜莎','女',20),(962,'美杜莎','女',20),(963,'美杜莎','女',20),(964,'美杜莎','女',20),(965,'美杜莎','女',20),(966,'美杜莎','女',20),(967,'美杜莎','女',20),(968,'美杜莎','女',20),(969,'美杜莎','女',20),(970,'美杜莎','女',20),(971,'美杜莎','女',20),(972,'美杜莎','女',20),(973,'美杜莎','女',20),(974,'美杜莎','女',20),(975,'美杜莎','女',20),(976,'美杜莎','女',20),(977,'美杜莎','女',20),(978,'美杜莎','女',20),(979,'美杜莎','女',20),(980,'美杜莎','女',20),(981,'美杜莎','女',20),(982,'美杜莎','女',20),(983,'美杜莎','女',20),(984,'美杜莎','女',20),(985,'美杜莎','女',20),(986,'美杜莎','女',20),(987,'美杜莎','女',20),(988,'美杜莎','女',20),(989,'美杜莎','女',20),(990,'美杜莎','女',20),(991,'美杜莎','女',20),(992,'美杜莎','女',20),(993,'美杜莎','女',20),(994,'美杜莎','女',20),(995,'美杜莎','女',20),(996,'美杜莎','女',20),(997,'美杜莎','女',20),(998,'美杜莎','女',20),(999,'美杜莎','女',20),(1001,'美杜莎','女',20),(1002,'美杜莎','女',20),(1003,'美杜莎','女',20),(1004,'美杜莎','女',20),(1005,'美杜莎','女',20),(1006,'美杜莎','女',20),(1007,'美杜莎','女',20),(1008,'美杜莎','女',20),(1009,'美杜莎','女',20),(1010,'美杜莎','女',20),(1011,'美杜莎','女',20),(1012,'美杜莎','女',20),(1013,'美杜莎','女',20),(1014,'美杜莎','女',20),(1015,'美杜莎','女',20),(1016,'美杜莎','女',20),(1017,'美杜莎','女',20),(1018,'美杜莎','女',20),(1019,'美杜莎','女',20),(1020,'美杜莎','女',20),(1021,'美杜莎','女',20),(1022,'美杜莎','女',20),(1023,'美杜莎','女',20),(1024,'美杜莎','女',20),(1025,'美杜莎','女',20),(1026,'美杜莎','女',20),(1027,'美杜莎','女',20),(1028,'美杜莎','女',20),(1029,'美杜莎','女',20),(1030,'美杜莎','女',20),(1031,'美杜莎','女',20),(1032,'美杜莎','女',20),(1033,'美杜莎','女',20),(1034,'美杜莎','女',20),(1035,'美杜莎','女',20),(1036,'美杜莎','女',20),(1037,'美杜莎','女',20),(1038,'美杜莎','女',20),(1039,'美杜莎','女',20),(1040,'美杜莎','女',20),(1041,'美杜莎','女',20),(1042,'美杜莎','女',20),(1043,'美杜莎','女',20),(1044,'美杜莎','女',20),(1045,'美杜莎','女',20),(1046,'美杜莎','女',20),(1047,'美杜莎','女',20),(1048,'美杜莎','女',20),(1049,'美杜莎','女',20),(1050,'美杜莎','女',20),(1051,'美杜莎','女',20),(1052,'美杜莎','女',20),(1053,'美杜莎','女',20),(1054,'美杜莎','女',20),(1055,'美杜莎','女',20),(1056,'美杜莎','女',20),(1057,'美杜莎','女',20),(1058,'美杜莎','女',20),(1059,'美杜莎','女',20),(1060,'美杜莎','女',20),(1061,'美杜莎','女',20),(1062,'美杜莎','女',20),(1063,'美杜莎','女',20),(1064,'美杜莎','女',20),(1065,'美杜莎','女',20),(1066,'美杜莎','女',20),(1067,'美杜莎','女',20),(1068,'美杜莎','女',20),(1069,'美杜莎','女',20),(1070,'美杜莎','女',20),(1071,'美杜莎','女',20),(1072,'美杜莎','女',20),(1073,'美杜莎','女',20),(1074,'美杜莎','女',20),(1075,'美杜莎','女',20),(1076,'美杜莎','女',20),(1077,'美杜莎','女',20),(1078,'美杜莎','女',20),(1079,'美杜莎','女',20),(1080,'美杜莎','女',20),(1081,'美杜莎','女',20),(1082,'美杜莎','女',20),(1083,'美杜莎','女',20),(1084,'美杜莎','女',20),(1085,'美杜莎','女',20),(1086,'美杜莎','女',20),(1087,'美杜莎','女',20),(1088,'美杜莎','女',20),(1089,'美杜莎','女',20),(1090,'美杜莎','女',20),(1091,'美杜莎','女',20),(1092,'美杜莎','女',20),(1093,'美杜莎','女',20),(1094,'美杜莎','女',20),(1095,'美杜莎','女',20),(1096,'美杜莎','女',20),(1097,'美杜莎','女',20),(1098,'美杜莎','女',20),(1099,'美杜莎','女',20),(1100,'美杜莎','女',20),(10002,'美杜莎','女',20),(10004,'美杜莎','女',20),(10005,'美杜莎','女',20),(10009,'美杜莎','女',20),(10010,'美杜莎','女',20),(10015,'海泽明','男',22),(10018,'汤米谢尔比','男',32),(10019,'海波东','男',36),(10020,'砝码','男',66);
/*!40000 ALTER TABLE `student` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_role`
--

DROP TABLE IF EXISTS `t_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_role` (
  `id` int NOT NULL AUTO_INCREMENT,
  `rolename` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `roledesc` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_role`
--

LOCK TABLES `t_role` WRITE;
/*!40000 ALTER TABLE `t_role` DISABLE KEYS */;
INSERT INTO `t_role` VALUES (1,'Administrator','超级管理员');
/*!40000 ALTER TABLE `t_role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_user`
--

DROP TABLE IF EXISTS `t_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_user` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(50) DEFAULT NULL,
  `password` varchar(50) DEFAULT NULL,
  `email` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_user`
--

LOCK TABLES `t_user` WRITE;
/*!40000 ALTER TABLE `t_user` DISABLE KEYS */;
INSERT INTO `t_user` VALUES (1,'lucy','123456','lucy@outlook.com'),(2,'jhon','123456','jhon@outlook.com');
/*!40000 ALTER TABLE `t_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_user_role`
--

DROP TABLE IF EXISTS `t_user_role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `t_user_role` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` int DEFAULT NULL,
  `role_id` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `user_userid` (`user_id`),
  KEY `user_roleid` (`role_id`),
  CONSTRAINT `user_roleid` FOREIGN KEY (`role_id`) REFERENCES `t_role` (`id`),
  CONSTRAINT `user_userid` FOREIGN KEY (`user_id`) REFERENCES `t_user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_user_role`
--

LOCK TABLES `t_user_role` WRITE;
/*!40000 ALTER TABLE `t_user_role` DISABLE KEYS */;
INSERT INTO `t_user_role` VALUES (1,1,1),(3,2,1);
/*!40000 ALTER TABLE `t_user_role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `teacher`
--

DROP TABLE IF EXISTS `teacher`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `teacher` (
  `jobnum` int NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `sex` char(2) NOT NULL,
  `subject` varchar(30) NOT NULL,
  PRIMARY KEY (`jobnum`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teacher`
--

LOCK TABLES `teacher` WRITE;
/*!40000 ALTER TABLE `teacher` DISABLE KEYS */;
INSERT INTO `teacher` VALUES (1,'默凡语','男','大学语文'),(2,'李宗盛','男','大学音乐'),(3,'娜美','女','大学美术'),(4,'罗宾','女','大学历史'),(5,'宋江','男','大学武术'),(7,'承太郎','男','大学日语');
/*!40000 ALTER TABLE `teacher` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-02 12:24:55
